import React from 'react';
import { CContainer, CRow, CCol } from '@coreui/react';

const insuranceTexts = {
  companyName: "ביטוחים",
  aboutUsData: [
    {
      title: "שירותים פיננסים",
      description: [
        "איתורים - שירותים פיננסים מספקת ייעוץ ביטוחים והכוונה לפתרונות מתקדמים בתחום הביטוח והייעוץ הפיננסי.",
        "המשרד דוגל במיומנות מקצועית גבוה של צוות עובדי החברה המונה עשרות עובדים ביניהם יועצי משכנתא, מנהלי תיקים, משפטנים, כלכלנים, סוכני ביטוח בריאות חיים ועוד. אנו עושים שימוש בכלים המתקדמים ביותר, על מנת להשיג את הפתרון הפיננסי הטוב ביותר עבורך ועבור משפחתך להבטיח לך שקט נפשי וביטחון בהחלטותיך הכלכליות.",
        "עם וותק של 5 שנות ניסיון איתורים - שירותים פיננסים מספקת ללקוחותיה ייעוץ והכוונה מקצועיים בתחומים השונים של ענף הביטוח לרבות ביטוחי משכנתאות, ביטוחי חיים, ביטוחי בריאות וסיעוד, ביטוחי תכולה ועוד.",
        "תפיסת השירות הייחודית שלנו משלבת בין הכרות אישית, מחויבות אמיתית ושקיפות מלאה מול לקוחותינו ובין יכולות מחשוב מקצועיות ומתקדמות."
      ]
    },
    {
      title: "שיתוף פעולה אסטרטגי",
      description: [
        "במשרד פועל באופן עצמאי ואינו בבעלות אף חברת ביטוח.",
        "אנו מקיימים שיתוף פעולה אסטרטגי עם כל חברות הביטוח המובילות במשק הישראלי. זה מאפשר לנו לבחור את הפתרון המתאים ביותר עבורכם, מתוך ההצעה הקיימת הן במבנה הפוליסה והן בדמי הניהול.",
        "אנו שומרים על מסורת ארגונית ארוכת שנים, המבוססת על תודעת שירות גבוהה ומקצועיות ללא פשרות, בטיפול בלקוחותינו, בכל פנייה ותביעה."
      ]
    }
  ]
};

export const Insurance = () => {
  return (
    <CContainer className="pages_wrapper_container">
      <CRow>
        <CCol>
          <h1>{insuranceTexts.companyName}</h1>
          {insuranceTexts.aboutUsData.map((section, index) => (
            <div key={index}>
              <h2>{section.title}</h2>
              {section.description.map((paragraph, idx) => (
                <p key={idx}>{paragraph}</p>
              ))}
            </div>
          ))}
        </CCol>
      </CRow>
    </CContainer>
  );
};
